BahaaTouaima/stm32-tracealyzer-pipeline/firmware/main_blinky.c
/*
 * FreeRTOS V202212.00
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates. All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * https://www.FreeRTOS.org
 * https://github.com/FreeRTOS
 *
 */

/******************************************************************************
 * This project provides two demo applications.  A simple blinky style project,
 * and a more comprehensive test and demo application.  The
 * mainCREATE_SIMPLE_BLINKY_DEMO_ONLY setting in main.c is used to select
 * between the two.  See the notes on using mainCREATE_SIMPLE_BLINKY_DEMO_ONLY
 * in main.c.  This file implements the simply blinky version.
 *
 * This file only contains the source code that is specific to the basic demo.
 * Generic functions, such FreeRTOS hook functions, are defined in main.c.
 ******************************************************************************
 *
 * main_blinky() creates one queue, one software timer, and two tasks.  It then
 * starts the scheduler.
 *
 * The Queue Send Task:
 * The queue send task is implemented by the prvQueueSendTask() function in
 * this file.  It uses vTaskDelayUntil() to create a periodic task that sends
 * the value 100 to the queue every 200 (simulated) milliseconds.
 *
 * The Queue Send Software Timer:
 * The timer is an auto-reload timer with a period of two (simulated) seconds.
 * Its callback function writes the value 200 to the queue.  The callback
 * function is implemented by prvQueueSendTimerCallback() within this file.
 *
 * The Queue Receive Task:
 * The queue receive task is implemented by the prvQueueReceiveTask() function
 * in this file.  prvQueueReceiveTask() waits for data to arrive on the queue.
 * When data is received, the task checks the value of the data, then outputs a
 * message to indicate if the data came from the queue send task or the queue
 * send software timer.
 *
 * The Stress Load Task (E5-01):
 * Added for Sprint 3 load testing. Runs a CPU-heavy loop at a higher
 * priority than the other two tasks, so we can observe how the scheduler
 * handles competing priorities under load.
 *
 * The TIM2 Sensor-Burst Interrupt (E5-02):
 * A hardware timer interrupt simulating a sensor firing at a baseline
 * rate, with periodic short high-frequency bursts. See prvSetupTim2Interrupt()
 * below and TIM2_IRQHandler() in startup_gcc.c.
 */

/* Standard includes. */
#include <stdio.h>

/* Kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
#include "queue.h"
#include "semphr.h"
/* Device includes (needed for RCC/TIM2/NVIC access in prvSetupTim2Interrupt). */
#include "stm32f4xx.h"

/* Priorities at which the tasks are created. */
#define mainQUEUE_RECEIVE_TASK_PRIORITY    ( tskIDLE_PRIORITY + 2 )
#define mainQUEUE_SEND_TASK_PRIORITY       ( tskIDLE_PRIORITY + 1 )
#define mainSTRESS_TASK_PRIORITY           ( tskIDLE_PRIORITY + 3 )

/* The rate at which data is sent to the queue.  The times are converted from
 * milliseconds to ticks using the pdMS_TO_TICKS() macro. */
#define mainTASK_SEND_FREQUENCY_MS         pdMS_TO_TICKS( 200UL )
#define mainTIMER_SEND_FREQUENCY_MS        pdMS_TO_TICKS( 2000UL )

/* The number of items the queue can hold at once. */
#define mainQUEUE_LENGTH                   ( 2 )

/* The values sent to the queue receive task from the queue send task and the
 * queue send software timer respectively. */
#define mainVALUE_SENT_FROM_TASK           ( 100UL )
#define mainVALUE_SENT_FROM_TIMER          ( 200UL )

/*-----------------------------------------------------------*/

/*
 * The tasks as described in the comments at the top of this file.
 */
static void prvQueueReceiveTask( void * pvParameters );
static void prvQueueSendTask( void * pvParameters );
static void prvStressLoadTask( void * pvParameters );
static void prvResourceHolderTask( void * pvParameters );
static void prvResourceClaimantTask( void * pvParameters );
/*
 * E5-02: configures TIM2 as a hardware interrupt source simulating a
 * sensor firing at a baseline rate, with periodic bursts.
 */
static void prvSetupTim2Interrupt( void );

/*
 * The callback function executed when the software timer expires.
 */
static void prvQueueSendTimerCallback( TimerHandle_t xTimerHandle );

/*-----------------------------------------------------------*/

/* The queue used by both tasks. */
static QueueHandle_t xQueue = NULL;

/* A software timer that is started from the tick hook. */
static TimerHandle_t xTimer = NULL;
/* E5-02: TIM2 ISR trace handle, registered once at setup. */
TraceISRHandle_t xTim2ISRHandle;
/*-----------------------------------------------------------*/
/* E5-03: Mutex for resource contention */
static SemaphoreHandle_t xContentionMutex = NULL;
/*** SEE THE COMMENTS AT THE TOP OF THIS FILE ***/
void main_blinky( void )
{
    const TickType_t xTimerPeriod = mainTIMER_SEND_FREQUENCY_MS;

    /* Create the queue. */
    xQueue = xQueueCreate( mainQUEUE_LENGTH, sizeof( uint32_t ) );

    /* E5-02: bring up the TIM2 sensor-burst interrupt. */
    prvSetupTim2Interrupt();

    /* TODO TraceRecorder (Tweak 4): Setting a name for the queue (optional). */
    vTraceSetQueueName(xQueue, "Blinky-Queue");

    if( xQueue != NULL )
    {
        /* Start the two tasks as described in the comments at the top of this
         * file. */
        xTaskCreate( prvQueueReceiveTask,             /* The function that implements the task. */
                     "Rx",                            /* The text name assigned to the task - for debug only as it is not used by the kernel. */
                     configMINIMAL_STACK_SIZE,        /* The size of the stack to allocate to the task. */
                     NULL,                            /* The parameter passed to the task - not used in this simple case. */
                     mainQUEUE_RECEIVE_TASK_PRIORITY, /* The priority assigned to the task. */
                     NULL );                          /* The task handle is not required, so NULL is passed. */

        xTaskCreate( prvQueueSendTask, "TX", configMINIMAL_STACK_SIZE, NULL, mainQUEUE_SEND_TASK_PRIORITY, NULL );

        /* E5-01: stress load task, higher priority, CPU-heavy loop. */
        xTaskCreate( prvStressLoadTask, "StressLoad", configMINIMAL_STACK_SIZE, NULL, mainSTRESS_TASK_PRIORITY, NULL );


       /* * E5-03: Create a mutex for resource contention testing */
        xContentionMutex = xSemaphoreCreateMutex();
        if( xContentionMutex != NULL )
        {
            vTraceSetMutexName(xContentionMutex, "ContentionMutex");
        }

        /* Create the resource contention tasks */
        xTaskCreate( prvResourceHolderTask, "ResHolder", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY + 1, NULL );
        xTaskCreate( prvResourceClaimantTask, "ResClaimant", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY + 3, NULL );




        /* Create the software timer, but don't start it yet. */
        xTimer = xTimerCreate( "Timer",                     /* The text name assigned to the software timer - for debug only as it is not used by the kernel. */
                               xTimerPeriod,                /* The period of the software timer in ticks. */
                               pdTRUE,                      /* xAutoReload is set to pdTRUE, so this is an auto-reload timer. */
                               NULL,                        /* The timer's ID is not used. */
                               prvQueueSendTimerCallback ); /* The function executed when the timer expires. */

        xTimerStart( xTimer, 0 );                           /* The scheduler has not started so use a block time of 0. */

        /* Start the tasks and timer running. */
        vTaskStartScheduler();
    }

    /* If all is well, the scheduler will now be running, and the following
     * line will never be reached.  If the following line does execute, then
     * there was insufficient FreeRTOS heap memory available for the idle and/or
     * timer tasks	to be created.  See the memory management section on the
     * FreeRTOS web site for more details.  NOTE: This demo uses static allocation
     * for the idle and timer tasks so this line should never execute. */
    for( ; ; )
    {
    }
}
/*-----------------------------------------------------------*/

static void prvSetupTim2Interrupt( void )
{
    RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;   /* enable TIM2 clock */
/* Note: these values target ~500ms on real STM32F405 hardware.
     * In this QEMU setup, actual observed period is ~44.8ms (QEMU
     * timer emulation runs faster than real hardware would). */
    TIM2->PSC = 8399;
    TIM2->ARR = 5000;
    TIM2->EGR = TIM_EGR_UG;      /* Load PSC/ARR shadow registers and reset CNT to 0 */
    TIM2->SR &= ~TIM_SR_UIF;     /* Clear update interrupt flag generated by UG bit */
    TIM2->DIER |= TIM_DIER_UIE;
    TIM2->CR1 |= TIM_CR1_CEN;

    xTraceISRRegister("TIM2_Sensor", 5, &xTim2ISRHandle);

    NVIC_SetPriority(TIM2_IRQn, 5);
    NVIC_EnableIRQ(TIM2_IRQn);
}
/*-----------------------------------------------------------*/

static void prvQueueSendTask( void * pvParameters )
{
    TickType_t xNextWakeTime;
    const TickType_t xBlockTime = mainTASK_SEND_FREQUENCY_MS;
    const uint32_t ulValueToSend = mainVALUE_SENT_FROM_TASK;

    /* Prevent the compiler warning about the unused parameter. */
    ( void ) pvParameters;

    /* Initialise xNextWakeTime - this only needs to be done once. */
    xNextWakeTime = xTaskGetTickCount();

    for( ; ; )
    {
        /* Place this task in the blocked state until it is time to run again.
         * The block time is specified in ticks, pdMS_TO_TICKS() was used to
         * convert a time specified in milliseconds into a time specified in ticks.
         * While in the Blocked state this task will not consume any CPU time. */
        vTaskDelayUntil( &xNextWakeTime, xBlockTime );

        /* Send to the queue - causing the queue receive task to unblock and
         * write to the console.  0 is used as the block time so the send operation
         * will not block - it shouldn't need to block as the queue should always
         * have at least one space at this point in the code. */
        xQueueSend( xQueue, &ulValueToSend, 0U );
    }
}
/*-----------------------------------------------------------*/

static void prvQueueSendTimerCallback( TimerHandle_t xTimerHandle )
{
    const uint32_t ulValueToSend = mainVALUE_SENT_FROM_TIMER;

    /* This is the software timer callback function.  The software timer has a
     * period of two seconds and is reset each time a key is pressed.  This
     * callback function will execute if the timer expires, which will only happen
     * if a key is not pressed for two seconds. */

    /* Avoid compiler warnings resulting from the unused parameter. */
    ( void ) xTimerHandle;

    /* Send to the queue - causing the queue receive task to unblock and
     * write out a message.  This function is called from the timer/daemon task, so
     * must not block.  Hence the block time is set to 0. */
    xQueueSend( xQueue, &ulValueToSend, 0U );
}
/*-----------------------------------------------------------*/

static void prvQueueReceiveTask( void * pvParameters )
{
    uint32_t ulReceivedValue;

    /* Prevent the compiler warning about the unused parameter. */
    ( void ) pvParameters;

    /* TraceRecorder: Registering a channel name for the user events. */
    TraceStringHandle_t xUserEventLogChannel;
    xTraceStringRegister("Log", &xUserEventLogChannel);

    for( ; ; )
    {
        /* Wait until something arrives in the queue - this task will block
         * indefinitely provided INCLUDE_vTaskSuspend is set to 1 in
         * FreeRTOSConfig.h.  It will not use any CPU time while it is in the
         * Blocked state. */
        xQueueReceive( xQueue, &ulReceivedValue, portMAX_DELAY );

        /*  To get here something must have been received from the queue, but
         * is it an expected value? */
        if( ulReceivedValue == mainVALUE_SENT_FROM_TASK )
        {
            /* It is normally not good to call printf() from an embedded system,
             * although it is ok in this simulated case. */
            printf( "Message received from task\r\n" );

            /******************************************************************
             * TODO TraceRecorder (Tweak 5): Added User Events (xTracePrint).
             * Can be a better alternative to printf (faster and thread-safe).
             * xTracePrint is similar to puts(), i.e. strings only.
             * xTracePrintF is similar to printf (with integer arguments).
             * Examples:
             *  xTracePrint(channel, "Something happened!");
             *  xTracePrintF(channel, "Value 1: %d, Value 2: %d", val1, val2);
             * See trcPrint.h for details.
             *****************************************************************/
            xTracePrint(xUserEventLogChannel, "Message received from task");
        }
        else if( ulReceivedValue == mainVALUE_SENT_FROM_TIMER )
        {
            printf( "Message received from software timer successfully\r\n" );

            xTracePrint(xUserEventLogChannel,
            		"Message received from software timer ");
        }
        else
        {
            printf( "Unexpected message\r\n" );

            xTracePrint(xUserEventLogChannel, "Unexpected message");
        }
    }
}
/*-----------------------------------------------------------*/

static void prvStressLoadTask( void * pvParameters )
{
    volatile uint32_t counter;

    /* Prevent the compiler warning about the unused parameter. */
    ( void ) pvParameters;

    for( ;; )
    {
        /* CPU-heavy loop: consumes CPU time for a measurable duration.
         * This is E5-01's load simulation -- a task that actually uses
         * the CPU, not one that just sleeps. */
        for( counter = 0; counter < 500000; counter++ )
        {
        }

        /* Short delay so the task stays periodic and observable in the
         * trace, instead of running forever with no visible pattern. */
        vTaskDelay( pdMS_TO_TICKS( 50 ) );
    }
}


/*-----------------------------------------------------------*/
static void prvResourceHolderTask( void * pvParameters )
{
    ( void ) pvParameters;

    for( ;; )
    {
        /* Low priority task takes the mutex and holds it for a while */
        if( xSemaphoreTake( xContentionMutex, portMAX_DELAY ) == pdTRUE )
        {
            // Hold the resource for 100ms simulating work
            vTaskDelay( pdMS_TO_TICKS( 100 ) );
            xSemaphoreGive( xContentionMutex );
        }
        // Rest before trying again
        vTaskDelay( pdMS_TO_TICKS( 300 ) );
    }
}



/*-----------------------------------------------------------*/

static void prvResourceClaimantTask( void * pvParameters )
{
    ( void ) pvParameters;

    for( ;; )
    {
        /* High priority task frequently tries to take the same mutex, forcing blocking */
        vTaskDelay( pdMS_TO_TICKS( 150 ) );
        
        if( xSemaphoreTake( xContentionMutex, pdMS_TO_TICKS( 50 ) ) == pdTRUE )
        {
            // Successfully acquired after blocking/waiting
            xSemaphoreGive( xContentionMutex );
        }
    }
}
/*-----------------------------------------------------------*/
